Repository: onikyannn/onibox-windows
Catalog: Onibox/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# Tray.Menu.ShowWindow
source: Show window
ru_ru: Показать окно

# Tray.Menu.UpdateConfig
source: Update config
ru_ru: Обновить конфиг

# Tray.Menu.Exit
source: Exit
ru_ru: Выйти из программы

# Status.Title
source: Status
ru_ru: Состояние

# Section.Connection.Title
source: Connection
ru_ru: Подключение

# Section.Connection.Description
source: Manage the connection and system proxy.
ru_ru: Управляйте подключением и системным прокси.

# Field.ConfigUrl.Header
source: Configuration
ru_ru: Конфигурация

# Field.ConfigUrl.Placeholder
source: https://example.com/config.json or C:\\config.json
ru_ru: https://example.com/config.json или C:\\config.json

# Field.InboundMode.Title
source: Mode
ru_ru: Режим работы

# Field.InboundMode.Description
source: Select how traffic should be routed.
ru_ru: Выберите, как маршрутизировать трафик.

# Field.InboundMode.Proxy
source: Proxy
ru_ru: Прокси

# Field.InboundMode.Tun
source: TUN
ru_ru: Туннель

# Action.UpdateConfiguration
source: Update
ru_ru: Обновить

# Toggle.AutoStart.Title
source: Autostart
ru_ru: Автозапуск

# Toggle.AutoStart.Description
source: Launch Onibox on Windows startup.
ru_ru: Запускать Onibox при старте Windows.

# Toggle.AutoStart.Off
source: Off
ru_ru: Выкл.

# Toggle.AutoStart.On
source: On
ru_ru: Вкл.

# Dialog.Error.Title
source: Error
ru_ru: Ошибка

# Dialog.Auth.Title
source: Authentication required
ru_ru: Требуется авторизация

# Dialog.Auth.Username
source: Username
ru_ru: Логин

# Dialog.Auth.Password
source: Password
ru_ru: Пароль

# Dialog.CancelButton
source: Cancel
ru_ru: Отмена

# Status.Connected
source: Connected
ru_ru: Подключено

# Status.Disconnected
source: Disconnected
ru_ru: Отключено

# Status.Connecting
source: Connecting...
ru_ru: Подключение...

# Status.Disconnecting
source: Disconnecting...
ru_ru: Отключение...

# Status.Updating
source: Updating...
ru_ru: Обновление...

# Action.Connect
source: Connect
ru_ru: Подключить

# Action.Disconnect
source: Disconnect
ru_ru: Отключить

# Message.ConfigUpdated
source: Configuration updated.
ru_ru: Конфигурация обновлена.

# Message.DownloadConfigFirst
source: Download the configuration first.
ru_ru: Сначала скачайте конфигурацию.

# Message.ProxyEnableFailed
source: Failed to enable system proxy: {0}
ru_ru: Не удалось включить системный прокси: {0}

# Message.ProxyDetectFailed
source: Failed to determine system proxy parameters: {0}
ru_ru: Не удалось определить параметры системного прокси: {0}

# Message.ProxyRestoreFailed
source: Failed to restore system proxy: {0}
ru_ru: Не удалось восстановить системный прокси: {0}

# Message.AutoStartFailed
source: Failed to change auto-start. Check permissions.
ru_ru: Не удалось изменить автозапуск. Проверьте права доступа.

# Message.LogPathWithErrorFormat
source: {0} Log: {1}
ru_ru: {0} Лог: {1}

# Error.ConfigUrl.Required
source: Provide the configuration URL.
ru_ru: Укажите URL конфигурации.

# Error.ConfigUrl.Scheme
source: URL must start with http:// or https://, or be a local file path.
ru_ru: URL должен начинаться с http:// или https://, либо быть локальным путем к файлу.

# Error.ConfigFile.Missing
source: Configuration file not found.
ru_ru: Файл конфигурации не найден.

# Error.BasicAuth.Required
source: Authentication is required.
ru_ru: Требуется авторизация.

# Error.BasicAuth.Invalid
source: Invalid username or password.
ru_ru: Неверный логин или пароль.

# Error.Inbound.MissingForMode
source: Inbound for mode '{0}' was not found in configuration.
ru_ru: Inbound для режима '{0}' не найден в конфигурации.

# Error.MixedInbound.PortMissing
source: Mixed inbound is missing a valid listen_port (or port).
ru_ru: В inbound mixed не указан корректный listen_port (или port).

# Error.SystemProxy.SettingsOpenFailed
source: Failed to open system proxy settings.
ru_ru: Не удалось открыть настройки системного прокси.

# Error.SingBoxExe.Missing
source: sing-box.exe was not found next to the app.
ru_ru: sing-box.exe не найден рядом с приложением.

# Error.SingBox.StartFailed
source: Failed to start sing-box.
ru_ru: Не удалось запустить sing-box.

# Error.Ui.DispatchFailed
source: Failed to schedule an action on the UI thread.
ru_ru: Не удалось запланировать действие на UI-потоке.
